public class JavaBasic {

    public static void main(String[] args) {

    }

    public static void firstTask(){
        //    Написать функцию, принимающую 2 аргумента - некое слово и букву.
        //    Функция должна посчитать сколько раз эта буква встречается в данном слове и вернуть полученное число вхождений.
        //
        //            ('а', 'колбаса') → 2
        //
        //            ('о', 'колбаса') → 1
        //
        //            ('ы', 'колбаса') → 0
    }

    public static void secondTask(){
        //    Написать метод, который будет возвращать значение медианы ряда целых чисел, поданного на вход.
        //    Медианой ряда чисел (медианой числового ряда) называется число, стоящее посередине упорядоченного по возрастанию ряда чисел — в случае,
        //    если количество чисел нечётное. Если же количество чисел в ряду чётно, то медианой ряда является полусумма двух стоящих посередине чисел упорядоченного по возрастанию ряда.

    }
}
